``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.cm2-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "cm2-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_condor-cm2.galaxyproject.eu_CNAME"
        name            = "condor-cm2.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.23",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.maintenance-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "maintenance-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_maintenance.galaxyproject.eu_A"
        name            = "maintenance.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.23",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.maintenance must be replaced
-/+ resource "openstack_compute_instance_v2" "maintenance" {
      ~ access_ip_v4        = "10.5.68.23" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "d324e8d9-8a15-4a54-ae60-440767bbab53" -> (known after apply)
      ~ id                  = "15305929-a5e7-4cea-9bc7-e743443b459f" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "maintenance.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ block_device {
          ~ uuid                  = "c6906a58-1e05-4be0-8f20-41f24c8320b5" -> "a57c3307-419f-4bcc-ab1f-7cd54906ae45" # forces replacement
          ~ volume_size           = 256 -> 50 # forces replacement
            # (4 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "10.5.68.23" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:59:7b:81" -> (known after apply)
            name           = "bioinf"
          + port           = (known after apply)
          ~ uuid           = "7de249b6-6d32-44e3-b50c-291939868d2f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```